import json



def makeBox():
  data = []
  for i in range(1,100):
    box_data = {
      "type": "Feature",
      "properties": {},
      "geometry": {
        "coordinates": [
          [
            [
              127.2455940767477 - (0.06368054661214 * i),
              36.424605481624056 - (0.000150070096156 * i),
              1000
            ],
            [
              127.2455940767477 - (0.06368054661214 * i),
              36.37839091827489 - (0.00015055117113 * i),
              1000
            ],
            [
              127.30704149634596 - (0.0612411355678 * i),
              36.37839091827489 - (0.00015055117113 * i),
              5000
            ],
            [
              127.30704149634596 - (0.0612411355678 * i),
              36.424605481624056 - (0.000150070096156 * i),
              1000
            ],
            [
              27.2455940767477 - (0.06368054661214 * i),
              36.424605481624056 - (0.000150070096156 * i),
              1000
            ]
          ]
        ],
        "type": "Polygon"
      }
    },
    data.append(box_data)    
# json 파일 만들기
    out_file = open('./man.json', "w", encoding='utf-8')
    json.dump(data, out_file, indent = 4, ensure_ascii=False)
    out_file.close()
    
makeBox()